In [1]:
%load_ext sql

In [2]:
from urllib.parse import quote_plus

password = quote_plus("pooja2005@#E")
connection_string = f"mysql+mysqlconnector://root:{password}@localhost/sql_notebook"

%sql {connection_string}

In [4]:
%%sql
use pd_da_cloud;

 * mysql+mysqlconnector://root:***@localhost/sql_notebook
0 rows affected.

[]

In [5]:
%%sql
create table enrollment( std_id int not null, course_id int not null,enrollment_date date,course_name varchar(100),
                         constraint pk_enrollment primary key(std_id,course_id));

 * mysql+mysqlconnector://root:***@localhost/sql_notebook
0 rows affected.

[]

In [11]:

%%sql
DROP TABLE IF EXISTS enrollment;

CREATE TABLE coustomertransaction (
    id INT PRIMARY KEY,
    login_device VARCHAR(50),
    customer_name VARCHAR(100),  -- Changed from BOOLEAN to VARCHAR
    ip_address VARCHAR(100),
    amount DECIMAL(10,2),
    is_placed BOOLEAN,
    is_viewed BOOLEAN,
    transaction_status VARCHAR(20)
);

 * mysql+mysqlconnector://root:***@localhost/sql_notebook
0 rows affected.
0 rows affected.

[]

In [12]:
%%sql
-- Sample INSERT statements for coustomertransaction
INSERT INTO coustomertransaction (id, login_device, customer_name, ip_address, amount, is_placed, is_viewed, transaction_status)
VALUES (1, 'Mobile', 'Alice', '192.168.1.10', 250.75, TRUE, TRUE, 'Completed');

INSERT INTO coustomertransaction (id, login_device, customer_name, ip_address, amount, is_placed, is_viewed, transaction_status)
VALUES (2, 'Desktop', 'Bob', '10.0.0.5', 1200.00, TRUE, FALSE, 'Pending');

INSERT INTO coustomertransaction (id, login_device, customer_name, ip_address, amount, is_placed, is_viewed, transaction_status)
VALUES (3, 'Tablet', 'Charlie', '172.16.0.3', 499.99, FALSE, TRUE, 'Failed');

INSERT INTO coustomertransaction (id, login_device, customer_name, ip_address, amount, is_placed, is_viewed, transaction_status)
VALUES (4, 'Mobile', 'Diana', '203.0.113.8', 89.50, TRUE, TRUE, 'Completed');

INSERT INTO coustomertransaction (id, login_device, customer_name, ip_address, amount, is_placed, is_viewed, transaction_status)
VALUES (5, 'Laptop', 'Ethan', '198.51.100.22', 999.99, FALSE, FALSE, 'Cancelled');

 * mysql+mysqlconnector://root:***@localhost/sql_notebook
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [14]:
%%sql
select * from coustomertransaction;

 * mysql+mysqlconnector://root:***@localhost/sql_notebook
5 rows affected.

[(1, 'Mobile', 'Alice', '192.168.1.10', Decimal('250.75'), 1, 1, 'Completed'),
 (2, 'Desktop', 'Bob', '10.0.0.5', Decimal('1200.00'), 1, 0, 'Pending'),
 (3, 'Tablet', 'Charlie', '172.16.0.3', Decimal('499.99'), 0, 1, 'Failed'),
 (4, 'Mobile', 'Diana', '203.0.113.8', Decimal('89.50'), 1, 1, 'Completed'),
 (5, 'Laptop', 'Ethan', '198.51.100.22', Decimal('999.99'), 0, 0, 'Cancelled')]

In [15]:
%%sql
INSERT INTO coustomertransaction (id, login_device, customer_name, ip_address, amount, is_placed, is_viewed, transaction_status)
VALUES (6, 'Smart TV', 'Farah', '192.0.2.45', 150.00, TRUE, FALSE, 'Completed');

INSERT INTO coustomertransaction (id, login_device, customer_name, ip_address, amount, is_placed, is_viewed, transaction_status)
VALUES (7, 'Mobile', 'Gaurav', '203.0.113.12', 75.25, FALSE, TRUE, 'Viewed');

INSERT INTO coustomertransaction (id, login_device, customer_name, ip_address, amount, is_placed, is_viewed, transaction_status)
VALUES (8, 'Desktop', 'Harini', '198.51.100.33', 300.00, TRUE, TRUE, 'Processing');

INSERT INTO coustomertransaction (id, login_device, customer_name, ip_address, amount, is_placed, is_viewed, transaction_status)
VALUES (9, 'Tablet', 'Ishaan', '10.1.1.1', 450.75, FALSE, FALSE, 'Failed');

INSERT INTO coustomertransaction (id, login_device, customer_name, ip_address, amount, is_placed, is_viewed, transaction_status)
VALUES (10, 'Laptop', 'Jaya', '172.20.10.5', 999.99, TRUE, TRUE, 'Completed');

 * mysql+mysqlconnector://root:***@localhost/sql_notebook
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [20]:
%%sql
select count(*)from coustomertransaction where transaction_status;

 * mysql+mysqlconnector://root:***@localhost/sql_notebook
1 rows affected.

[(2,)]